# IContextMenuCreator Methods

---
The IContextMenuCreator type exposes the following members.
| Name| Description
---|---|---
| BuildContextMenu|  Build a Context Menu.
Top
#### Reference
IContextMenuCreator Interface
Autodesk.Revit.UI Namespace